In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Basics").getOrCreate()

In [83]:
df= spark.read.format("csv").option("header","true").load("hdfs://localhost:9000/Spark/test.csv")
df.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| null|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| null|       S|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| null|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| null|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| null|       S|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| null|       S|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| null|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| null|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| null|       C|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| null|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|null|    0|    0|          349220| 7.8958| null|       S|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| null|       S|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| null|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| null|       C|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| null|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| null|       C|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| null|       S|
|        911|     3|"Assaf Khalil, Mr...|female|  45|    0|    0|            2696|  7.225| null|       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [71]:
df.select("Name").show()

+--------------------+
|                Name|
+--------------------+
|    Kelly, Mr. James|
|Wilkes, Mrs. Jame...|
|Myles, Mr. Thomas...|
|    Wirz, Mr. Albert|
|Hirvonen, Mrs. Al...|
|Svensson, Mr. Joh...|
|Connolly, Miss. Kate|
|Caldwell, Mr. Alb...|
|Abrahim, Mrs. Jos...|
|Davies, Mr. John ...|
|    Ilieff, Mr. Ylio|
|Jones, Mr. Charle...|
|Snyder, Mrs. John...|
|Howard, Mr. Benjamin|
|Chaffee, Mrs. Her...|
|del Carlo, Mrs. S...|
|   Keane, Mr. Daniel|
|   Assaf, Mr. Gerios|
|Ilmakangas, Miss....|
|"Assaf Khalil, Mr...|
+--------------------+
only showing top 20 rows

In [72]:
df.filter("Age > 46").show()

+-----------+------+--------------------+------+----+-----+-----+-----------+--------+---------------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|    Fare|          Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+-----------+--------+---------------+--------+
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|     363272|       7|           null|       S|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|     240276|  9.6875|           null|       Q|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|      24065|      26|           null|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|W.E.P. 5734|  61.175|            E31|       S|
|        912|     1|Rothschild, Mr. M...|  male|  55|    1|    0|   PC 17603|    59.4|           null|       C|
|        916|     1|Ryerson, Mrs. Art...|female|  48|    1|    3|   PC 17608| 262.375|B57 B59 B63 B66|       C|
|        917|     3|Robins, Mr. Alexa...|  male|  50|    1|    0|  A/5. 3337|    14.5|           null|       S|
|        922|     2|Louch, Mr. Charle...|  male|  50|    1|    0| SC/AH 3085|      26|           null|       S|
|        940|     1|Bucknell, Mrs. Wi...|female|  60|    0|    0|      11813| 76.2917|            D15|       C|
|        959|     1|Moore, Mr. Claren...|  male|  47|    0|    0|     113796|    42.4|           null|       S|
|        961|     1|Fortune, Mrs. Mar...|female|  60|    1|    4|      19950|     263|    C23 C25 C27|       S|
|        969|     1|Cornell, Mrs. Rob...|female|  55|    2|    0|      11770|    25.7|           C101|       S|
|        973|     1|  Straus, Mr. Isidor|  male|  67|    1|    0|   PC 17483|221.7792|        C55 C57|       S|
|        974|     1|Case, Mr. Howard ...|  male|  49|    0|    0|      19924|      26|           null|       S|
|        988|     1|Cavendish, Mrs. T...|female|  76|    1|    0|      19877|   78.85|            C46|       S|
|       1006|     1|Straus, Mrs. Isid...|female|  63|    1|    0|   PC 17483|221.7792|        C55 C57|       S|
|       1023|     1|Gracie, Col. Arch...|  male|  53|    0|    0|     113780|    28.5|            C51|       C|
|       1034|     1|Ryerson, Mr. Arth...|  male|  61|    1|    3|   PC 17608| 262.375|B57 B59 B63 B66|       C|
|       1044|     3|  Storey, Mr. Thomas|  male|60.5|    0|    0|       3701|    null|           null|       S|
|       1058|     1|  Brandeis, Mr. Emil|  male|  48|    0|    0|   PC 17591| 50.4958|            B10|       C|
+-----------+------+--------------------+------+----+-----+-----+-----------+--------+---------------+--------+
only showing top 20 rows

In [73]:
df.groupBy("Age").count().show()

+----+-----+
| Age|count|
+----+-----+
|38.5|    1|
|26.5|    1|
|   7|    1|
|  51|    1|
|0.75|    1|
|  15|    1|
|  54|    2|
|22.5|    1|
|  29|   10|
|  42|    5|
|  64|    3|
|   3|    1|
|  30|   15|
|  34|    1|
|  59|    1|
|   8|    2|
|  22|   16|
|  28|    7|
|  35|    5|
|  16|    2|
+----+-----+
only showing top 20 rows

In [74]:
df.createOrReplaceTempView("titanic")

In [75]:
sqldf = spark.sql("select * from titanic")
sqldf.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| null|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| null|       S|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| null|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| null|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| null|       S|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| null|       S|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| null|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| null|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| null|       C|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| null|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|null|    0|    0|          349220| 7.8958| null|       S|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| null|       S|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| null|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| null|       C|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| null|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| null|       C|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| null|       S|
|        911|     3|"Assaf Khalil, Mr...|female|  45|    0|    0|            2696|  7.225| null|       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [76]:
sqldf = spark.sql("select * from titanic where `Sex`='male'")
sqldf.show()

+-----------+------+--------------------+----+----+-----+-----+----------+-------+-----+--------+
|PassengerId|Pclass|                Name| Sex| Age|SibSp|Parch|    Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+----+----+-----+-----+----------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|male|34.5|    0|    0|    330911| 7.8292| null|       Q|
|        894|     2|Myles, Mr. Thomas...|male|  62|    0|    0|    240276| 9.6875| null|       Q|
|        895|     3|    Wirz, Mr. Albert|male|  27|    0|    0|    315154| 8.6625| null|       S|
|        897|     3|Svensson, Mr. Joh...|male|  14|    0|    0|      7538|  9.225| null|       S|
|        899|     2|Caldwell, Mr. Alb...|male|  26|    1|    1|    248738|     29| null|       S|
|        901|     3|Davies, Mr. John ...|male|  21|    2|    0| A/4 48871|  24.15| null|       S|
|        902|     3|    Ilieff, Mr. Ylio|male|null|    0|    0|    349220| 7.8958| null|       S|
|        903|     1|Jones, Mr. Charle...|male|  46|    0|    0|       694|     26| null|       S|
|        905|     2|Howard, Mr. Benjamin|male|  63|    1|    0|     24065|     26| null|       S|
|        908|     2|   Keane, Mr. Daniel|male|  35|    0|    0|    233734|  12.35| null|       Q|
|        909|     3|   Assaf, Mr. Gerios|male|  21|    0|    0|      2692|  7.225| null|       C|
|        912|     1|Rothschild, Mr. M...|male|  55|    1|    0|  PC 17603|   59.4| null|       C|
|        913|     3|Olsen, Master. Ar...|male|   9|    0|    1|   C 17368| 3.1708| null|       S|
|        915|     1|Williams, Mr. Ric...|male|  21|    0|    1|  PC 17597|61.3792| null|       C|
|        917|     3|Robins, Mr. Alexa...|male|  50|    1|    0| A/5. 3337|   14.5| null|       S|
|        919|     3|   Daher, Mr. Shedid|male|22.5|    0|    0|      2698|  7.225| null|       C|
|        920|     1|Brady, Mr. John B...|male|  41|    0|    0|    113054|   30.5|  A21|       S|
|        921|     3|   Samaan, Mr. Elias|male|null|    2|    0|      2662|21.6792| null|       C|
|        922|     2|Louch, Mr. Charle...|male|  50|    1|    0|SC/AH 3085|     26| null|       S|
|        923|     2|Jefferys, Mr. Cli...|male|  24|    2|    0|C.A. 31029|   31.5| null|       S|
+-----------+------+--------------------+----+----+-----+-----+----------+-------+-----+--------+
only showing top 20 rows

In [77]:
sqldf.count()

266

In [78]:
df.printSchema()

root
 |-- PassengerId: string (nullable = true)
 |-- Pclass: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- SibSp: string (nullable = true)
 |-- Parch: string (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: string (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [79]:
df.describe().show()

+-------+------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+
|summary|       PassengerId|            Pclass|                Name|   Sex|               Age|             SibSp|             Parch|            Ticket|              Fare|Cabin|Embarked|
+-------+------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+
|  count|               418|               418|                 418|   418|               332|               418|               418|               418|               417|   91|     418|
|   mean|            1100.5|2.2655502392344498|                null|  null|30.272590361445783|0.4473684210526316|0.3923444976076555|223850.98986486485|  35.6271884892086| null|    null|
| stddev|120.81045760473994|0.8418375519640503|                null|  null|14.181209235624424|0.8967595611217135|0.9814288785371694| 369523.7764694362|55.907576179973844| null|    null|
|    min|              1000|                 1|"Assaf Khalil, Mr...|female|              0.17|                 0|                 0|            110469|                 0|  A11|       C|
|    max|               999|                 3|van Billiard, Mas...|  male|                 9|                 8|                 9|       W.E.P. 5734|              93.5|   G6|       S|
+-------+------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+

In [80]:
df.head()

Row(PassengerId='892', Pclass='3', Name='Kelly, Mr. James', Sex='male', Age='34.5', SibSp='0', Parch='0', Ticket='330911', Fare='7.8292', Cabin=None, Embarked='Q')

In [81]:
df.withColumn('New Age',df['Age']).show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|New Age|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| null|       Q|   34.5|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| null|       S|     47|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| null|       Q|     62|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| null|       S|     27|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| null|       S|     22|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| null|       S|     14|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| null|       Q|     30|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| null|       S|     26|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| null|       C|     18|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| null|       S|     21|
|        902|     3|    Ilieff, Mr. Ylio|  male|null|    0|    0|          349220| 7.8958| null|       S|   null|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| null|       S|     46|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|     23|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| null|       S|     63|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|     47|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| null|       C|     24|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| null|       Q|     35|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| null|       C|     21|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| null|       S|     27|
|        911|     3|"Assaf Khalil, Mr...|female|  45|    0|    0|            2696|  7.225| null|       C|     45|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+-------+
only showing top 20 rows

In [ ]:
df.show()

In [70]:
df.withColumnRenamed('Age','Age1').show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex|Age1|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| null|       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| null|       S|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| null|       Q|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| null|       S|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| null|       S|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| null|       S|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| null|       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| null|       S|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| null|       C|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| null|       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|null|    0|    0|          349220| 7.8958| null|       S|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| null|       S|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| null|       S|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| null|       C|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| null|       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| null|       C|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| null|       S|
|        911|     3|"Assaf Khalil, Mr...|female|  45|    0|    0|            2696|  7.225| null|       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [ ]:
df.withColumn('add_one_age',df['Age']+1).show()

In [82]:
df.withColumn('half_age',df['Age']/2).show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|half_age|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| null|       Q|   17.25|
|        893|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|          363272|      7| null|       S|    23.5|
|        894|     2|Myles, Mr. Thomas...|  male|  62|    0|    0|          240276| 9.6875| null|       Q|    31.0|
|        895|     3|    Wirz, Mr. Albert|  male|  27|    0|    0|          315154| 8.6625| null|       S|    13.5|
|        896|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|         3101298|12.2875| null|       S|    11.0|
|        897|     3|Svensson, Mr. Joh...|  male|  14|    0|    0|            7538|  9.225| null|       S|     7.0|
|        898|     3|Connolly, Miss. Kate|female|  30|    0|    0|          330972| 7.6292| null|       Q|    15.0|
|        899|     2|Caldwell, Mr. Alb...|  male|  26|    1|    1|          248738|     29| null|       S|    13.0|
|        900|     3|Abrahim, Mrs. Jos...|female|  18|    0|    0|            2657| 7.2292| null|       C|     9.0|
|        901|     3|Davies, Mr. John ...|  male|  21|    2|    0|       A/4 48871|  24.15| null|       S|    10.5|
|        902|     3|    Ilieff, Mr. Ylio|  male|null|    0|    0|          349220| 7.8958| null|       S|    null|
|        903|     1|Jones, Mr. Charle...|  male|  46|    0|    0|             694|     26| null|       S|    23.0|
|        904|     1|Snyder, Mrs. John...|female|  23|    1|    0|           21228|82.2667|  B45|       S|    11.5|
|        905|     2|Howard, Mr. Benjamin|  male|  63|    1|    0|           24065|     26| null|       S|    31.5|
|        906|     1|Chaffee, Mrs. Her...|female|  47|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|    23.5|
|        907|     2|del Carlo, Mrs. S...|female|  24|    1|    0|   SC/PARIS 2167|27.7208| null|       C|    12.0|
|        908|     2|   Keane, Mr. Daniel|  male|  35|    0|    0|          233734|  12.35| null|       Q|    17.5|
|        909|     3|   Assaf, Mr. Gerios|  male|  21|    0|    0|            2692|  7.225| null|       C|    10.5|
|        910|     3|Ilmakangas, Miss....|female|  27|    1|    0|STON/O2. 3101270|  7.925| null|       S|    13.5|
|        911|     3|"Assaf Khalil, Mr...|female|  45|    0|    0|            2696|  7.225| null|       C|    22.5|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
only showing top 20 rows